---
kind: property
id: P:Autodesk.Revit.DB.BuiltInFailures.GeometryFailures.SymbolicLineInvalidPlane
source: html/1f313dd1-85e1-68ba-7345-f4bfaad2ee01.htm
---
# Autodesk.Revit.DB.BuiltInFailures.GeometryFailures.SymbolicLineInvalidPlane Property

Symbolic Element refers to a Work Plane with unacceptable normal.

## Syntax (C#)
```csharp
public static FailureDefinitionId SymbolicLineInvalidPlane { get; }
```